# SQL Basic Join
<p>The following practice problems were completed on <a href="www.hackerrank.com">HackerRank.com</a>.</p>
<p>Generally speaking, the problems ascend from easier to more difficult.</p>
<p>Relational Database Management System: <b>MySQL</b></p>

## Problem Set Tables #1

The CITY and COUNTRY tables are described as follows:

<img src='images/1449729804-f21d187d0f-CITY.jpg'>
<img src='images/1449769013-e54ce90480-Country.jpg'>

### Problems
1. African Cities: Given the CITY and COUNTRY tables, query the names of all cities where the CONTINENT is 'Africa'.  Note: CITY.CountryCode and COUNTRY.Code are matching key columns. (Difficulty: <span style='color:green'>Easy</span>)
2. Average Population of Each Continent: Given the CITY and COUNTRY tables, query the names of all the continents (COUNTRY.Continent) and their respective average city populations (CITY.Population) rounded down to the nearest integer. Note: CITY.CountryCode and COUNTRY.Code are matching key columns. (Difficulty: <span style='color:green'>Easy</span>)

#### Query #1
African Cities: Given the CITY and COUNTRY tables, query the names of all cities where the CONTINENT is 'Africa'.  
Note: CITY.CountryCode and COUNTRY.Code are matching key columns. (Difficulty: Easy)
##### Query
SELECT CITY.NAME  
FROM CITY  
INNER JOIN COUNTRY ON CITY.COUNTRYCODE = COUNTRY.CODE  
WHERE COUNTRY.CONTINENT = 'Africa';  
##### Output
Qina  
Warraq al-Arab  
Kempton Park  
Alberton  
Klerksdorp  
Uitenhage  
Brakpan  
Libreville

#### Query #2
Average Population of Each Continent: Given the CITY and COUNTRY tables, query the names of all the continents (COUNTRY.Continent) and their respective average city populations (CITY.Population) rounded down to the nearest integer. (Difficulty: <span style='color:green'>Easy</span>)  
Note: CITY.CountryCode and COUNTRY.Code are matching key columns.
##### Query
SELECT COUNTRY.CONTINENT, FLOOR(AVG(CITY.POPULATION))  
FROM CITY  
INNER JOIN COUNTRY ON CITY.COUNTRYCODE = COUNTRY.CODE  
GROUP BY COUNTRY.CONTINENT;    
##### Output
Africa 274439  
Asia 693038  
Europe 175138  
Oceania 109189  
South America 147435

## Problem Set Tables #2

You are given two tables: Students and Grades.  
Students contains three columns ID, Name and Marks.
<img src='images/1443818166-a5c852caa0-1.png'>
Grades contains the following data:
<img src='images/1443818137-69b76d805c-2.png'>

### Problems
1. The Report: Ketty gives Eve a task to generate a report containing three columns: Name, Grade and Mark. Ketty doesn't want the NAMES of those students who received a grade lower than 8. The report must be in descending order by grade -- i.e. higher grades are entered first. If there is more than one student with the same grade (8-10) assigned to them, order those particular students by their name alphabetically. Finally, if the grade is lower than 8, use "NULL" as their name and list them by their grades in descending order. If there is more than one student with the same grade (1-7) assigned to them, order those particular students by their marks in ascending order. Write a query to help Eve. (Difficulty: <span style='color:orange'>Medium</span>)

#### Query #1
The Report: Ketty gives Eve a task to generate a report containing three columns: Name, Grade and Mark. Ketty doesn't want the NAMES of those students who received a grade lower than 8. The report must be in descending order by grade -- i.e. higher grades are entered first. If there is more than one student with the same grade (8-10) assigned to them, order those particular students by their name alphabetically. Finally, if the grade is lower than 8, use "NULL" as their name and list them by their grades in descending order. If there is more than one student with the same grade (1-7) assigned to them, order those particular students by their marks in ascending order. Write a query to help Eve. (Difficulty: <span style='color:orange'>Medium</span>)
##### Query
SELECT CASE WHEN Grade < 8 THEN 'NULL' ELSE Students.Name END, Grades.Grade, Students.Marks  
FROM Students, Grades  
WHERE Students.Marks BETWEEN Grades.Min_Mark AND Grades.Max_Mark  
ORDER BY Grade DESC, Students.Name ASC;  
##### Output
Britney 10 95  
Heraldo 10 94  
Julia 10 96  
Kristeen 10 100  
Stuart 10 99  
Amina 9 89  
Christene 9 88  
Salma 9 81  
Samantha 9 87  
Scarlet 9 80  
Vivek 9 84  
Aamina 8 77  
Belvet 8 78  
Paige 8 74  
Priya 8 76  
Priyanka 8 77  
NULL 7 64  
NULL 7 66  
NULL 6 55  
NULL 4 34  
NULL 3 24

## Problem Set Tables #3

The following tables contain contest data:
- Hackers: The hacker_id is the id of the hacker, and name is the name of the hacker. <img src='images/1458526776-67667350b4-ScreenShot2016-03-21at7.45.59AM.png'>
- Difficulty: The difficult_level is the level of difficulty of the challenge, and score is the score of the challenge for the difficulty level. <img src='images/1458526915-57eb75d9a2-ScreenShot2016-03-21at7.46.09AM.png'>
- Challenges: The challenge_id is the id of the challenge, the hacker_id is the id of the hacker who created the challenge, and difficulty_level is the level of difficulty of the challenge. <img src='images/1458527032-f9ca650442-ScreenShot2016-03-21at7.46.17AM.png'>
- Submissions: The submission_id is the id of the submission, hacker_id is the id of the hacker who made the submission, challenge_id is the id of the challenge that the submission belongs to, and score is the score of the submission. <img src='images/1458527077-298f8e922a-ScreenShot2016-03-21at7.46.29AM.png'>

### Problems
1. Top Competitors: Julia just finished conducting a coding contest, and she needs your help assembling the leaderboard! Write a query to print the respective hacker_id and name of hackers who achieved full scores for more than one challenge. Order your output in descending order by the total number of challenges in which the hacker earned a full score. If more than one hacker received full scores in same number of challenges, then sort them by ascending hacker_id. (Difficulty: <span style='color:orange'>Medium</span>)

#### Query #1
Top Competitors: Julia just finished conducting a coding contest, and she needs your help assembling the leaderboard! Write a query to print the respective hacker_id and name of hackers who achieved full scores for more than one challenge. Order your output in descending order by the total number of challenges in which the hacker earned a full score. If more than one hacker received full scores in same number of challenges, then sort them by ascending hacker_id. (Difficulty: <span style='color:orange'>Medium</span>)
##### Query
SELECT H.hacker_id, H.name  
FROM Hackers H  
INNER JOIN Submissions S ON H.hacker_id = S.hacker_id  
INNER JOIN Challenges C ON S.challenge_id = C.challenge_id  
INNER JOIN Difficulty D ON C.difficulty_level = D.difficulty_level  
WHERE S.score = D.score  
GROUP BY H.hacker_id, H.name  
HAVING COUNT(S.hacker_id) > 1  
ORDER BY COUNT(S.hacker_id) DESC, H.hacker_id ASC;  

##### Output
27232 Phillip  
28614 Willie  
15719 Christina  
43892 Roy  
14246 David  
14372 Michelle  
18330 Lawrence  
26133 Jacqueline  
26253 John  
30128 Brandon  
35583 Norma  
13944 Victor  
17295 Elizabeth  
19076 Matthew  
26895 Evelyn  
32172 Jonathan  
41293 Robin  
45386 Christina  
45785 Jesse  
49652 Christine  
13391 Robin  
14366 Donna  
14777 Gerald  
16259 Brandon  
17762 Joseph  
28275 Debra  
36228 Nancy  
37704 Keith  
40226 Anna  
49307 Brian  
12539 Paul  
14363 Joyce  
14658 Stephanie  
19448 Jesse  
20504 John  
20534 Martha  
22196 Anthony  
23678 Kimberly  
28299 David  
30721 Ann  
32254 Dorothy  
46205 Joyce  
47641 Patricia  
13122 James  
13762 Gloria  
14863 Walter  
18690 Marilyn  
18983 Lori  
21212 Timothy  
25732 Antonio  
28250 Evelyn  
30755 Emily  
38852 Benjamin  
42052 Andrew  
44188 Diana  
48984 Gregory  
13380 Kelly  
13523 Ralph  
21463 Christine  
24663 Louise  
26243 Diana  
26289 Dorothy  
39277 Charles  
23278 Paula  
25184 Martin  
32121 Dorothy  
36322 Andrew  
39782 Tammy  
40257 James  
41319 Jean  
10857 Kevin  
25238 Paul  
34242 Marilyn  
39771 Alan  
49789 Lillian  
57947 Justin  
74413 Harry